In [11]:
# Operations

import numpy as np
import pandas as pd

df = pd.DataFrame(
    {
        "col1": [1, 2, 3, 4],
        "col2": [444, 555, 666, 444],
        "col3": ["abc", "def", "ghi", "xyz"],
    }
)
df

df['col2'].unique()
len(df['col2'].unique())
df['col2'].nunique()

df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [16]:
def times2(x):
    return x*2

df['col1'].apply(times2)

df['col3'].apply(len) # custom functions or inbuilt functions can be passed

df['col2'].apply(lambda x: x/4)

0    111.00
1    138.75
2    166.50
3    111.00
Name: col2, dtype: float64

In [20]:
df.columns, df.dtypes, df.index

(Index(['col1', 'col2', 'col3'], dtype='object'),
 col1     int64
 col2     int64
 col3    object
 dtype: object,
 RangeIndex(start=0, stop=4, step=1))

In [25]:
df.isnull(),
df.sort_values('col1')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [29]:
data = {
    "A": ["foo", "foo", "foo", "bar", "bar", "bar"],
    "B": ["one", "one", "two", "two", "one", "one"],
    "C": ["x", "y", "x", "y", "x", "y"],
    "D": [1, 3, 2, 5, 4, 1],
}
dataframe = pd.DataFrame(data)
dataframe

dataframe.pivot_table(values="D", index=["A", "B"], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN